# RebarNoMatchingHooks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarNoMatchingHooks Property
BuiltInFailures..::..RebarFailures Class See Also
---
The Rebar Shape '[Family Name]' has no matching hooks.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarNoMatchingHooks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarNoMatchingHooks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarNoMatchingHooks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace